Revit 2027 API
UIView.ZoomToFit Method
 Zoom the view to fit its contents.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ZoomToFit()
Public Sub ZoomToFit
public:
void ZoomToFit()
member ZoomToFit : unit -> unit
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace